// МОДУЛЬ 10 ЗАНЯТТЯ 2
// Як нам самостійно створити Проміс для робоити з Асинхронним кодом
const promise = new Promise((resolve, reject) => {
  const random = Math.random();
  setTimeout(() => {
    if (random > 0.5) {
      resolve("ok");
    } else {
      reject("ops");
    }
  }, 2000);
});
// Щоб створити проміс для роботи з асинхронним кодом створюємо змінну promise ми звертаємось до класу Promise
// І створюємо його екземпляр new Promise як параметри в круглі дужки передаємо стрілочну функцію яка буде
// приймати в себе два методи (resolve, reject)
// random - змінна яка буде генерувати в себе якесь випадкове число
// Щоб написати в середині промісу асинхронний код звертаємось до методу setTimeout
// І в ньму за допомогою циклів if та else будемо перевіряти виконання або не виконання нашого промісу
// Метод resolve - відповідає за виконання нашого промісу і в середину передаємо данні які ми хочемо отримати
// при успішному виконанні нашого промісу "ok"
// Метод reject - відповідає за не виконання нашого промісу і в середину передаємо данні які ми хочемо отримати
// при не виконанні нашого промісу "ops"
