// МОДУЛЬ 9 ПЕРШЕ ЗАНЯТТЯ
const obj = '{ "a": 5 }';
// Щоб зробити наш об'єкт валіднид для Jsone потрібно
// 1 Преретворити його на рядок  "{ a: 5 }"
// 2 Щоб Jsone був валідним його ключ потрібно огорнути в подвійні лапки "a"
// 3  \"a\" - саме слеш подвійні лапки ключ a слеш подвійні лапки вони екрануєть
// тобто перекривають наш ключ і він стає валідним для Jsone
// Для того щоб перевірити валідніть нам потрібно розпарсити наш об'єкт за допомогою методу parse(obj)
console.log(JSON.parse(obj));
// Ми звертаємось до JSON крапка метод parse і в круглі дужки передаємо назву об'єкта (obj) який хочемо розпарсити
// У консолі ми отримаємо наш  об'єкт  { "a": 5 } ключ "a" та значення 5

// ЛОКАЛЬНЕ СХОВИЩЕ localStorage

const LS_KEY = "Array of name";
const names = ["Alise", "Kate", "Emma"];
//Два параметра      ключ   значення
// localStorage.setItem(LS_KEY, "lalala");
// Звертаємось до localStorage
// Далі метод setItem який приймає в круглі дужки два параметри (ключ, значення)
localStorage.setItem(LS_KEY, names);
