// МОДУЛЬ 10 ПЕРШЕ ЗАНЯТТЯ
// А синхроний код - це код на виконання якого потрібен не визначений час
// А синхроний метод setTimeout() приймає в себе два параметри
// setTimeout(() => { }, 2000);
// 1-й ()=>{} - колбек або стрілочна функція яка передається в іншу функцію як аргумент
// 2-й 2000 - це час в  мілі секундах він потрібен для того щоб наш метод setTimeout запустив функцію ()=>{}
// передану як перший аргумент саме через цей проміжок часу тобто через 2000 мілі секунд
console.log("a");
setTimeout(() => {
  console.log("time");
}, 2000);
console.log("c");
// Результат у консолі буде з початку а потім с потім time хоча time мав би бути другим але відпрацював останнім
// все відбувається тому що наш метод setTimeout а синхронний

// for (let i = 3; i > 0; i--){
//     const delay = i * 1000;
//     setTimeout(() => {
//         console.log(i)
//     }, delay);
// }
