// МОДУЛЬ 8 ДРУГЕ ЗАНЯТТЯ
// ДЕСТРУКТУРИЗАЦІЯ об'єкта
const city = "Kyiv";
const user = {
  username: "Alise",
  age: 25,
  skills: {
    html: true,
    css: true,
    js: false,
  },
  city: "lviv",
};

// const { username, age } = user;
// Для деструктуризації ми створюємо змінну {} ставемо літерал об'єкта і в середину передаємо ключі в яких
// зберігаються значення  { username, age } після дорівнює назва об'єкта user який ми хочемо деструктуризувати
// const { username, age, city } = user;
// city якщо ми додаємо ключ якого не має в нашому об'єкті ми отримаємо undefidet і для цьго щоб
// запобігти такій поведінці ми в будь яку властивість city яку ми деструктуруємо ми
// можемо присвоїти значення за замовчуванням
// const { username, age, city = "Dnipro" } = user;
// Тепер під час виклику так як ключа city в нашому об'єкті не має то відобразиться значення яке
// ми йому присвоїли "Dnipro"
// Якщо в об'єкті є така властивість із іншим значенням то буде відображатися те що в об'єкті
// тоді "Dnipro" не відобразиться під час виклику. Це в нас як резервний варіант "Dnipro"
const { username, age, city: userCity = "Dnipro" } = user;
// cyty: userCity - за рахунок присвоєння нового значення наші змінні city
// не будуть конфліктувати в коді і під час виклику
//  userCity = "Dnipro" тут ми також можемо присвоїти значення "Dnipro" на випадок якщо city в нашому
// об'єкті може не бути
console.log(city);
// Тепер коли ми викликаємо city ми отримаємо "Kyiv"
console.log(userCity);
// Тепер коли ми викликаємо userCity ми отримаємо  "lviv"
console.log(age);
