// МОДУЛЬ 9 2 ЗАНЯТТЯ
// 1 Локально копіюємо наш проект собі на ПК
// 2 Щоб скопіювати репозиторій потрібно настиснути в ГІТ ХАБ Зелену кнопку КОД і з віти скопіювати посилання
// 3 Переходимо в термінал і пишемо команду git clone і вставляємо посилання
// Приклад git clone https://github.com/AnatoliyUrev86/project1.git
// 4 Потім ми повинні перейти в нашу папку для роботи є два способи
// 1-й через file Open Folder і вибрати папку із назвою нашого проєкту
// 2-й в терміналі ввести команду  cd і назву папки в якій проект і Ентер
// 5 Встанови базові залежності проекту в терміналі командою npm instal але що саме ми звідси берем
// npm instal в ній є властивості які знаходяться в файлі js під назвою package.jsone і в цьму файлі
// нас цікавить наступне "devDependencies" та  "dependencies" ті пакети які прописані в цих об'єктах
// і будуть встановлені коли ми в терміналі пропишемо команду npm instal
// ми прописуємо після того коли знаходимся в актуальній папці Приклад
// git clone https://github.com/AnatoliyUrev86/project1.git і псля пишемо npm instal саме так має бути
// і тепер де наші папки та файли у нас додається папка node_modules в цій папці власне зберігаються
// всі бібліотеки плагіни які можуть бути підключені до проекту  ДАННА ПАПКА НЕ ПОВИННА БУТИ В РЕПОЗИТОРІЇ
// ТУДИ МИ ЇЇ НЕ ПУШИМО для того щоб цього уникнути ми у папці
// gitignore в ньму в середині прописуються папки та файли ЯКІ НЕ ПОТРІБНО ПУШИТИ НА ГІТ ХАБ
// 6 Наш проект зібраний за допомогою vite - він дає можливість не запускати Лайф сервер а відразу
// буде запускати його сам коли ми будемо вносити зміни або зайдемо на проект Vite Nexte Generatoin Tooling
//Команда для встановлення Vite через термінал -  npm create vite@latest
